app/controllers/api/comments_controller.rb

    def index
      respond_with Comment.all
---
SELECT "comments".* FROM "comments"

    def show
      respond_with Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]