app/controllers/api/entries_controller.rb

    def index
      respond_with Entry.all
---
SELECT "entries".* FROM "entries"