app/views/entries/index.html.erb

      <div class="panel-footer">
        <p><%= entry.comments.count %><%=' comentarios'%></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."entry_id" = $1  [["entry_id", 14]]