app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("Creador", "Comentario", "created_at", "updated_at", "entry_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["Creador", "hh"], ["Comentario", "dasd"], ["created_at", "2018-03-19 05:58:48.149615"], ["updated_at", "2018-03-19 05:58:48.149615"], ["entry_id", 36]]