app/controllers/entries_controller.rb

  def index
    @entries = Entry.all.order(created_at: :desc).limit(10)
---
SELECT  "entries".* FROM "entries" ORDER BY "entries"."created_at" DESC LIMIT $1  [["LIMIT", 10]]

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("Titulo", "Bajada", "Cuerpo", "Fecha", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["Titulo", "fda"], ["Bajada", "fda"], ["Cuerpo", "fda"], ["Fecha", "2018-03-01"], ["created_at", "2018-03-19 04:49:37.397871"], ["updated_at", "2018-03-19 04:49:37.397871"]]